# RbsDuctConnectorSystemClassificationParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDuctConnectorSystemClassificationParam Property
ParameterTypeId Class See Also
---
"System Classification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDuctConnectorSystemClassificationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDuctConnectorSystemClassificationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDuctConnectorSystemClassificationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace